{
    "architectures": [
        "Qwen2VLForConditionalGeneration"
    ],
    "bos_token_id": 151643,
    "eos_token_id": 151645,
    "hidden_act": "silu",
    "hidden_size": 3584,
    "initializer_range": 0.02,
    "intermediate_size": 18944,
    "max_position_embeddings": 32768,
    "model_type": "qwen2_vl",
    "num_attention_heads": 28,
    "num_key_value_heads": 4,
    "num_hidden_layers": 1,
    "pad_token_id": 151643,
    "rms_norm_eps": 1e-06,
    "tie_word_embeddings": false,
    "torch_dtype": "bfloat16",
    "use_cache": true,
    "vocab_size": 152064,
    "draft_vocab_size": 32000
}